<img src="./../../img/123-1766391441643-4.png" alt="avatar" style="width: 125px; height: auto;">

# 刘智延

​			 年龄：20岁		性别：男

​			 电话：`13438761369`       邮箱：`LZY3376163189@163.com`     

> ​             求职意向：软件测试/测试开发实习生    一周内到岗    可实习六个月以上            

## 基本信息

### 西南石油大学 - 双一流 - 数字媒体技术专业   (2023.09 - 2027.06)

## 实习经历

**深圳锐明技术有限公司** - 测试实习生					2025 - 03 ——2025 - 08													

**工作描述**：

在锐明中担任公交测试组的实习生，参与**Ptcloud**项目（云平台）的全流程质量保障工作，覆盖**基础数据、服务部署、权限控制**模块的测试验证。

**主要工作：**

1. 参与产品需求评审，覆盖**用户权限管理、客户需求、资源监控**，累计输出测试用例200+条。
2. 参与**接口自动化**开发与用例编写，并集成到平台的CI/CD流程中
3. 执行**功能测试、回归测试及兼容性测试**，验证云平台在Windows/Linux系统及多浏览器（Chrome/Firefox/Edge）环境下的稳定性，累计发现并提交有效缺陷80+个。
4. 熟练使用**禅道**跟踪缺陷生命周期，详细记录复现步骤、日志截图及影响范围，推动开发团队修复权限配置失效、缺陷关闭率提升至98%。
5. 整理测试执行结果，输出《版本测试报告》，缺陷分布及风险点，为产品上线决策提供依据。

**实习成果:**

业务理解能力深化，能够从用户视角设计测试场景，平衡功能完整性与易用性。测试技能提升，独立完成从需求分析到测试执行的完整流程。从需求文档中提取20+关键测试点，累计推动修复高优先级缺陷15+。

## 专业技能

- 掌掘Java核心语法，熟练掌握面向对象编程、异常处理、泛型、多线程及lambda表达式等技术。
- 熟悉SpringBoot框架，掌握SpringBoot的依赖注入、AOP、事务管理、缓存机制等。
- 熟悉计算机网络OSI网络五层协议模型，TCP/UDP/HTTP/HTTPS通信协议。
- 熟悉项目开发流程，软件测试的工作流程，掌握需求评审，用例评审等概念。
- 熟悉如何描述一个bug，掌握如何提bug到jira/禅道平台，掌握bug的生命周期。
- 熟练使用Postman进行接口测试，如断言、关联，能够通过模拟HTTP请求对接口进行测试。
- 熟练使用Charles抓包工具的基本使用，如抓取Web端或手机端的http和https报文，断电测试，App弱网测试
- 掌握web自动化测试框架Selenium定位页面元素的常见方法，包括CSS selector、XPath等。
- 掌握Python结合Pytest编写单元测试case，掌握pytest的常用插件，并通过Jenkins执行生成allure报告。
- 熟悉CI/CD，DevOps等概念，掌握Jenkins流水线常见语法，并能够结合Git独立搭建自动化流水线脚本。

## 项目经历                

**石油订餐平台**（订餐项目，后端开发+测试）				2025-01 ——  2025-02

测试用例+自动化测试代码 [石油订餐平台（外卖项目）测试用例Xmind+自动化测试代码（JAVA+Selenium）](https://blog.csdn.net/2401_83524644/article/details/145611256?sharetype=blogdetail&sharerId=145611256&sharerefer=PC&sharesource=2401_83524644&spm=1011.2480.3001.8118)

项目源码gitee：[石油订餐平台](https://gitee.com/Absolutelynothing/Meituan-Crowdsourcing)

**核心技术**：Springboot、Mybatis、JWT、Redis、AOP、WebSocket、Apache POI、阿里云OSS
后端架构设计与实现：设计并实现了系统的核心后端逻辑，包括用户认证、订单处理、实时通知等功能模块。
